# Börsenkurse kompilieren

In [25]:
import pandas as pd

In [26]:
import glob

## Dateien laden

**Liste der Dateien erstellen**

In [27]:
path = 'Bluechips/'

In [28]:
filenames = glob.glob(path + '*.csv')

In [29]:
filenames[0]

'Bluechips/ZURN.SW.csv'

**Liste von Dataframes mit den Dateien**

In [30]:
dfs = []

In [31]:
dfs = [pd.read_csv(filename) for filename in filenames]

## Daten aggregieren

**Spalte mit Company Name hinzufügen**

In [32]:
for df, filename in zip(dfs, filenames):
    df['Ticker'] = filename
    df['Ticker'] = df['Ticker'].str.extract(path + '(.+).SW.csv')

In [33]:
dfs[0].head(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
0,2012-09-03,228.600006,230.100006,227.699997,229.399994,121.235756,268447,ZURN
1,2012-09-04,229.300003,229.600006,226.899994,228.100006,120.548706,342534,ZURN

**Daten aneinanderreihen**

In [34]:
df_all = pd.concat(dfs, ignore_index=True)

In [35]:
df_all.head(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
0,2012-09-03,228.600006,230.100006,227.699997,229.399994,121.235756,268447,ZURN
1,2012-09-04,229.300003,229.600006,226.899994,228.100006,120.548706,342534,ZURN

In [36]:
df_all.tail(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
53706,2023-09-08,57.299999,57.32,56.279999,56.740002,56.740002,982113,HOLN
53707,2023-09-11,56.820000,57.18,56.779999,57.060001,57.060001,773695,HOLN

**Name für Ticker hinzufügen**

In [37]:
df_names = pd.read_csv('company_names_2023.csv')

In [38]:
df_names.head(2)

   Company Ticker
0  ABB LTD   ABBN
1    ALCON    ALC

In [39]:
df_all_m = df_all.merge(df_names, how='left', on='Ticker')

**Spalte Close auswählen und Pivot**

In [40]:
df_pivoted = df_all_m.pivot(index='Date', columns='Company', values='Close')

In [41]:
df_pivoted.head(2)

Company,ABB LTD,ALCON,GEBERIT,GIVAUDAN,HOLCIM,KUEHNE NAEL,LOGITECH,LONZA,NESTLE,NOVARTIS,PARTNERS GROUP,RICHEMONT,ROCHE,SIKA,SONOVA,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,UBS GROUP,ZURICH INSURANCE
Date,,,,,,,,,,,,,,,,,,,,
2012-09-03,16.709999,NaN,204.100006,907.0,56.095238,109.599998,8.850,40.840107,59.950001,49.945457,183.300003,60.000000,174.800003,30.766666,89.056259,109.099998,60.299999,385.200012,10.73,229.399994
2012-09-04,16.480000,NaN,200.199997,896.0,55.333332,107.400002,9.095,40.376961,59.150002,49.459263,189.000000,59.150002,173.000000,30.183332,88.708580,109.300003,60.150002,385.799988,10.56,228.100006

In [42]:
df_pivoted.rename_axis(None, inplace=True)

In [43]:
df_pivoted.rename_axis(None, inplace=True)

In [44]:
df_pivoted.head(2)

Company,ABB LTD,ALCON,GEBERIT,GIVAUDAN,HOLCIM,KUEHNE NAEL,LOGITECH,LONZA,NESTLE,NOVARTIS,PARTNERS GROUP,RICHEMONT,ROCHE,SIKA,SONOVA,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,UBS GROUP,ZURICH INSURANCE
2012-09-03,16.709999,NaN,204.100006,907.0,56.095238,109.599998,8.850,40.840107,59.950001,49.945457,183.300003,60.000000,174.800003,30.766666,89.056259,109.099998,60.299999,385.200012,10.73,229.399994
2012-09-04,16.480000,NaN,200.199997,896.0,55.333332,107.400002,9.095,40.376961,59.150002,49.459263,189.000000,59.150002,173.000000,30.183332,88.708580,109.300003,60.150002,385.799988,10.56,228.100006

In [45]:
df_pivoted.tail(2)

Company,ABB LTD,ALCON,GEBERIT,GIVAUDAN,HOLCIM,KUEHNE NAEL,LOGITECH,LONZA,NESTLE,NOVARTIS,PARTNERS GROUP,RICHEMONT,ROCHE,SIKA,SONOVA,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,UBS GROUP,ZURICH INSURANCE
2023-09-08,32.869999,73.599998,447.200012,2900.0,56.740002,260.100006,62.900002,483.799988,105.220001,88.120003,1021.5,117.0,256.700012,242.600006,215.199997,558.200012,88.919998,541.799988,22.760000,411.000000
2023-09-11,33.000000,73.919998,448.899994,2883.0,57.060001,260.100006,62.900002,487.200012,106.099998,88.309998,1016.0,117.0,253.899994,243.100006,217.100006,563.200012,90.339996,542.200012,22.879999,414.600006

## Daten exportieren

In [46]:
df_pivoted.to_csv('smi_members.csv')